[{
        "name": "Bash",
        "description": "Bash is a Unix shell and command language that provides a command-line interface for interacting with a Unix or Linux operating system."
    },
    {
        "name": "Command",
        "description": "A command is a directive given to the shell to perform a specific action or task, such as creating a new directory or copying a file."
    },
    {
        "name": "Script",
        "description": "A script is a file containing a series of commands and instructions that can be executed by the Bash shell."
    },
    {
        "name": "Variable",
        "description": "A variable is a named value that can be used to store data or information in Bash scripts. Variables can be assigned values, and these values can be retrieved and manipulated in various ways."
    },
    {
        "name": "Environment Variable",
        "description": "An environment variable is a variable that is set in the operating system and can be accessed by any application or process running on the system. Environment variables are often used to store configuration information or other system-related data."
    },
    {
        "name": "Redirection",
        "description": "Redirection is the process of redirecting the input or output of a command or script to a file or device other than the default. For example, output from a command can be redirected to a file instead of the console."
    },
    {
        "name": "Pipe",
        "description": "A pipe is a mechanism for connecting the output of one command to the input of another command in Bash. Pipes allow commands to be chained together to perform more complex operations."
    },
    {
        "name": "Conditionals",
        "description": "Conditionals are statements that evaluate whether a certain condition is true or false, and execute different commands or actions based on the result. Bash supports several types of conditionals, including if-then, if-then-else, and case statements."
    },
    {
        "name": "Loop",
        "description": "A loop is a programming construct that allows a block of code to be executed repeatedly based on a certain condition. Bash supports several types of loops, including for loops, while loops, and until loops."
    },
    {
        "name": "Function",
        "description": "A function is a block of code that can be called from other parts of a Bash script, allowing for code reuse and modularity. Functions can take parameters and return values, and can be defined either within a script or in an external file."
    },
    {
        "name": "Parameter",
        "description": "An input value or argument passed to a Bash command or function that modifies its behavior or output. Parameters can be positional, named, or both, and can be used to customize the behavior of many Bash commands and scripts."
    }
]