[{
        "name": "Algorithm",
        "description": "A set of instructions or rules for solving a problem or performing a task. Algorithms can be expressed in various forms, including natural language, pseudocode, flowcharts, and programming languages."
    },
    {
        "name": "Data Structure",
        "description": "A way of organizing and storing data in a computer so that it can be accessed and manipulated efficiently. Common data structures include arrays, linked lists, trees, graphs, and hash tables."
    },
    {
        "name": "Programming Language",
        "description": "A formal language used to express algorithms and programs in a way that can be executed by a computer. Programming languages vary in their syntax, semantics, and features, and can be used for a wide range of applications, from web development to scientific computing."
    },
    {
        "name": "Computer Architecture",
        "description": "The design and organization of computer systems, including their hardware components (e.g., CPU, memory, storage) and software interfaces (e.g., instruction sets, operating systems). Computer architecture determines the performance, reliability, and functionality of a computer system."
    },
    {
        "name": "Operating System",
        "description": "The software that manages and controls the basic functions and resources of a computer system, including memory, storage, input/output devices, and software applications. Operating systems provide a common interface for interacting with the computer and running programs."
    },
    {
        "name": "Database",
        "description": "A collection of data that is organized and stored in a computer system in a way that enables efficient retrieval, modification, and querying. Databases can be used for a wide range of applications, from managing customer data to scientific research."
    },
    {
        "name": "Networking",
        "description": "The practice of connecting computer systems and devices together to share resources and information. Networking involves protocols, hardware components (e.g., routers, switches, cables), and software applications that enable communication and data transfer between devices."
    },
    {
        "name": "Artificial Intelligence",
        "description": "The branch of computer science that deals with creating intelligent machines that can perform tasks that typically require human intelligence, such as understanding natural language, recognizing images, and making decisions. Artificial intelligence involves a range of techniques, including machine learning, natural language processing, and computer vision."
    },
    {
        "name": "Software Development",
        "description": "The process of designing, creating, testing, and maintaining software applications and systems. Software development involves a range of activities, including requirements gathering, design, coding, testing, and deployment, and requires knowledge of programming languages, software tools, and development methodologies."
    },
    {
        "name": "Computer Security",
        "description": "The practice of protecting computer systems and networks from unauthorized access, use, disclosure, disruption, modification, or destruction. Computer security involves a range of techniques, including cryptography, access control, intrusion detection, and security audits."
    },
    {
        "name": "Algorithm",
        "description": "A set of instructions or rules that are followed in order to solve a problem or perform a task. Algorithms are used in computer science to design and analyze programs, data structures, and other computational systems."
    },
    {
        "name": "Data Structure",
        "description": "A way of organizing and storing data in a computer program or system. Common data structures include arrays, linked lists, trees, and graphs, which are used to represent and manipulate different types of data."
    },
    {
        "name": "Programming Language",
        "description": "A formal language used to write computer programs. Programming languages are designed to express algorithms and data structures in a way that can be executed by a computer."
    },
    {
        "name": "Object-Oriented Programming",
        "description": "A programming paradigm that emphasizes the use of objects to represent and manipulate data. Object-oriented programming languages, such as Java and Python, allow developers to encapsulate data and behavior into reusable objects, which can be organized into classes and hierarchies."
    },
    {
        "name": "Compiler",
        "description": "A program that translates source code written in a programming language into machine code that can be executed by a computer. Compilers are used to convert high-level programming languages into low-level instructions that can be executed by a processor."
    },
    {
        "name": "Operating System",
        "description": "The software that manages and controls the basic functions and operations of a computer system. Operating systems provide a platform for running applications, managing hardware resources, and providing a user interface."
    },
    {
        "name": "Network",
        "description": "A group of interconnected devices and communication channels that allow data to be shared and transmitted between different systems. Networks can be used to connect computers, servers, mobile devices, and other types of devices, enabling communication and collaboration across different locations and environments."
    },
    {
        "name": "Database",
        "description": "A structured collection of data that is organized and stored in a computer system. Databases are used to manage and manipulate data, and can be accessed and queried using specialized software tools and programming languages."
    },
    {
        "name": "Artificial Intelligence",
        "description": "The field of computer science that focuses on the development of intelligent machines that can perform tasks that normally require human intelligence, such as learning, problem-solving, perception, and decision-making. AI techniques include machine learning, natural language processing, computer vision, and robotics."
    },
    {
        "name": "Encryption",
        "description": "The process of transforming data into a form that is unreadable or unintelligible to unauthorized parties. Encryption is used to protect sensitive information and prevent unauthorized access or disclosure, and can be applied to files, communications, and other types of data."
    }
]